gudang_bangunan/app/Controllers/Auth.php

    public function processLogin()
    {
        // Mendapatkan data username dan password dari form
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Membuat instance dari UserModel
        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'andika'
 LIMIT 1