gudang_bangunan/app/Controllers/Barang.php

    public function tabel_barang()
    {
        $model = new BarangModel();
        $data['barang'] = $model->findAll();
---
SELECT *
FROM `barang`

    public function store()
    {
        $model = new BarangModel();
        $data = [
            'nama_barang' => $this->request->getPost('nama_barang'),
            'kategori' => $this->request->getPost('kategori'),
            'satuan' => $this->request->getPost('satuan'),
            'harga_satuan' => $this->request->getPost('harga_satuan'),
            'stok_tersedia' => $this->request->getPost('stok_tersedia'),
            'tanggal_masuk' => $this->request->getPost('tanggal_masuk'),
        ];
        $model->insert($data);
---
INSERT INTO `barang` (`nama_barang`, `kategori`, `satuan`, `harga_satuan`, `stok_tersedia`, `tanggal_masuk`) VALUES ('Cat Soklin Merah', 'cat', 'liter', '20000', '50', '2025-01-10')